[
    {
        "id": "in-86e8ffe63048aff3",
        "site": "indeed",
        "job_url": "https://ca.indeed.com/viewjob?jk=86e8ffe63048aff3",
        "job_url_direct": "https://jsv3.recruitics.com/redirect?rx_cid=3662&rx_jobId=4493746005rxv_58_108&rx_url=https%3A%2F%2Fjob-boards.greenhouse.io%2Foutlierai%2Fjobs%2F4493746005%3Fgh_src%3Dbbfbcbd25us%26rx_a%3D0%26rx_c%3D%26rx_ch%3Djobp4p%26rx_group%3D301098%26rx_job%3D4493746005rxv_58_108%26rx_medium%3Dcpc%26rx_r%3Dnone%26rx_source%3Dindeed%26rx_ts%3D20241107T060604Z%26rx_vp%3Dcpc%26utm_campaignDescription%3DSpecialist%26utm_owner%3Drecruitics%26utm_source%3Dindeed%26utm_targetCountry%3Dus%26utm_targetLanguage%3D%26utm_taskerType%3D",
        "title": "AI Math Instructor",
        "company": "Outlier AI",
        "location": "Edmonton, AB, CA",
        "date_posted": "2024-11-03",
        "job_type": "contract",
        "salary_source": "None",
        "interval": "None",
        "min_amount": "None",
        "max_amount": "None",
        "currency": "None",
        "is_remote": "True",
        "job_level": "None",
        "job_function": "None",
        "listing_type": "None",
        "emails": "nan",
        "description": "**Outlier helps the world’s most innovative companies improve their AI models by providing human feedback.** **Are you an experienced** **Math Expert****who would like to lend your expertise to train AI models?**\n\n  \n\n\n**About the opportunity:**\n\n  \n\n\n* Outlier is looking for talented **Math Experts** to help train generative artificial intelligence models\n* This freelance opportunity is remote and hours are flexible, so you can work whenever is best for you\n\n\n**You may contribute your expertise by…**\n\n  \n\n\n* Assessing the factuality and relevance of domain\\-specific text produced by AI models\n* Crafting and answering questions related to **Math**\n* Evaluating and ranking domain\\-specific responses generated by AI models\n\n  \n\n\n**Examples of desirable expertise:**\n\n  \n\n\n* A bachelor's or higher degree in **Math** or a related subject\n* Experience working as a Mathprofessional\n* Ability to write clearly about concepts related to **Math** in fluent English\n\n  \n\n\n**Payment:**\n\n\n* Currently, pay rates for core project work by **Math** experts range from $30 to $50 per hour USD.\n\n  \n\n\n* Rates vary based on expertise, skills assessment, location, project need, and other factors. For example, higher rates may be offered to PhDs. For non\\-core work, such as during initial project onboarding or project overtime phases, lower rates may apply. Certain projects offer incentive payments. Please review the payment terms for each project.\n\n\n*PLEASE NOTE: We collect, retain and use personal data for our professional business purposes, including notifying you of opportunities that may be of interest and sharing with our affiliates. We limit the personal data we collect to that which we believe is appropriate and necessary to manage applicants’ needs, provide our services, and comply with applicable laws. Any information we collect in connection with your application will be treated in accordance with the* *Outlier Privacy Policy* *and our internal policies and programs designed to protect personal data.*\n\n\n*This is a 1099 contract opportunity on the* *Outlier.ai* *platform. Because this is a freelance opportunity, we do not offer internships, sponsorship, or employment. You must be authorized to work in your country of residence. If you are an international student, you may be able to sign up for Outlier if you are on a visa. You should contact your tax and/or immigration advisor with specific questions regarding your circumstances.*",
        "company_industry": "nan",
        "company_url": "https://ca.indeed.com/cmp/Outlier-Ai",
        "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e6cbe87f729939dc98b4afbd3afbee34",
        "company_url_direct": "https://www.outlier.ai",
        "company_addresses": "Oakland",
        "company_num_employees": "11 to 50",
        "company_revenue": "nan",
        "company_description": "nan"
    },
    {
        "id": "in-4b30b5376304179c",
        "site": "indeed",
        "job_url": "https://ca.indeed.com/viewjob?jk=4b30b5376304179c",
        "job_url_direct": "https://careers.pcl.com/job/Edmonton-Data-Science-Student-AB/1209078700/?feedId=354800&utm_source=Indeed&utm_campaign=PCL_Indeed",
        "title": "Data Science Student",
        "company": "PCL Construction",
        "location": "Edmonton, AB, CA",
        "date_posted": "2024-11-01",
        "job_type": "fulltime",
        "salary_source": "None",
        "interval": "None",
        "min_amount": "None",
        "max_amount": "None",
        "currency": "None",
        "is_remote": "True",
        "job_level": "None",
        "job_function": "None",
        "listing_type": "None",
        "emails": "careers@pcl.com",
        "description": "**The future you want is within reach.**\n\n  \n\nAt PCL, we build the places where life happens and find camaraderie in the process. We’re a community of builders committed to building better communities. That’s why we’re always looking ahead, and not just to the next project or what’s next in our industry.\n\n  \n\nWe’re also looking at what’s next for you and how we can help you build a career you’re proud of. As a student at PCL, you will get the opportunity for challenging work assignments in a supportive work environment which promotes personal and professional growth.\n\n  \n\nWe are seeking a **Data Science** **Student** for our **Canadian Industrial Division** district office in Edmonton, AB, that is availablefor **4 or** **8 months** starting in **January, 2025\\.** This position will be under the direct supervision of the **Manager, Data Science**.\n\n **Remote work not available for this position.**\n\n**Responsibilities**\n--------------------\n\n* Gain proficiency in exploratory data analysis, perform it, and present insights.\n* Prepare data sets for visualization and machine learning modeling.\n* Train machine learning systems using data annotation and benchmarking techniques.\n* Help your colleagues assess AI/ML model performance and propose paths for potential improvement.\n* Prepare data visualizations using industry\\-leading tools to summarize results for stakeholders.\n* Document your results \\- tell the story of the work, the successes, and the lessons\\-learned for posterity.\n* Keep an open mind, in order to utilize your unique skills and your determination when other opportunities arise.\n\n **This position has a twist**. Contingent on successful early work, the team member will have a chance to build their portfolio through a capstone project. For the final two months, a portion of their time will be focused on a design\\-focused initiative, of value to PCL, of their choosing. You'll be supported while you:\n\n* Develop a proposal\n* Engage with the right people to inform your work\n* Build your prototype or visualization\n* Assess and present the results\n**Qualifications**\n------------------\n\n* Currently enrolled in a postsecondary program\n* You should be an outstanding bachelor's or mathematics student in engineering, computing, or mathematical sciences. Alternatively, you could be pursuing an MSc in a quantitative field. If your field of study differs, apply: we’d like to hear why you'll be a good fit regardless.\n* Analytical skills – ability to quickly analyze data to identify and visualize key insights – as evidenced by coursework, projects, or research requiring the analysis of large datasets.\n* Coursework in statistics. Applied statistics and probability are the focus of the position: if you can converse about regression models, and clustering approaches, you'll be fine.\n* Prior exposure to a statistical or scientific programming environment is helpful. If you don't have it, you'll become familiar while you're with us. We have a bias for open source tech, and work with the Python scientific stack, R, PowerBI, and various data pipeline tools.\n* Excellent oral and written communication skills will help. You'll work with both experts in the field and business staff, so you’ll find it important to be able to communicate appropriately with both as needed.\n\n  \n\nNext Step:\n\n\nPlease note that candidates who have been selected to move forward to the next stage of the recruitment process will receive an email to complete a short online video interview.\n\n\nPCL is an innovative, employee\\-owned company comprised of people who find passion in their profession and take pride in doing great work every day. Our work powers the infrastructure and utilities that are essential to daily life and our projects are the scene of vacations, careers, education and healing. We are consistently ranked among the best companies to work for because we are committed to supporting and developing our teams.  \n\n  \n\nThe PCL Companies celebrate diversity and are proud to be an equal opportunity employer. We are committed to creating equitable opportunities and an inclusive environment for all employees and applicants. We make employment\\-related decisions without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, age, disability or veteran status.  \n\n  \n\nPCL combines numerous pay and benefit strategies to provide a comprehensive and competitive total rewards package. Any salary range displayed by a job board is an estimate. Your salary, which considers your unique qualifications and experience, is just one component of the robust total rewards you'll enjoy at PCL. This may include an employee share purchase offering, discretionary annual performance bonus, comprehensive benefits and wellness programs, retirement plan plus matching, and career development programs.  \n\n  \n\nShould you require an accommodation during the application process, please contact us at careers@pcl.com with the position and location you are interested in.  \n\n  \n\nTogether, we can build success and a better future. Let’s get started!\n\n **Employee Status:** Internship Full\\-Time\n\n**Company:** PCL Industrial Management Inc.\n\n**Primary Location:** Edmonton, Alberta (Ind Mgmt)\n\n**Job:** Data Science Student\n\n**Requisition**: 6750",
        "company_industry": "Construction",
        "company_url": "https://ca.indeed.com/cmp/Pcl-Construction",
        "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/80646c27f2b8121c1acd0c23ab6d5fc8",
        "company_url_direct": "http://www.pcl.com",
        "company_addresses": "9915 56th Ave. NW Edmonton, AB T6E 5L7",
        "company_num_employees": "1,001 to 5,000",
        "company_revenue": "$5B to $10B (USD)",
        "company_description": "Aspiring to be the most respected builder, renowned for excellence, leadership, and unsurpassed value."
    },
    {
        "id": "in-b7520ad30c3e4f42",
        "site": "indeed",
        "job_url": "https://ca.indeed.com/viewjob?jk=b7520ad30c3e4f42",
        "job_url_direct": "https://krb-sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?partnerid=30122&siteid=6598&PageType=JobDetails&jobid=2191400",
        "title": "Software Development Intern",
        "company": "Lockheed Martin",
        "location": "Calgary, AB, CA",
        "date_posted": "2024-10-28",
        "job_type": "fulltime",
        "salary_source": "None",
        "interval": "None",
        "min_amount": "None",
        "max_amount": "None",
        "currency": "None",
        "is_remote": "False",
        "job_level": "None",
        "job_function": "None",
        "listing_type": "None",
        "emails": "nan",
        "description": "Engineering\nCalgary, AB\n16011BR\n**About the role**\n\n\nAs a Software Developer Intern you will be working on mission critical software for the control and analytics of Unmanned Vehicles and Systems.\n\n\nLockheed Martin Canada CDL Systems software is deployed globally in Small (SUAS), Medium (Shadow RQ\\-7\\), Large (Grey Eagle MQ\\-1C), and high altitude pseudo satellite (HAPS) systems as well as surface vehicles and target systems.\n\n\nAs part of the Skunkworks team, you'll have the opportunity to work on cutting edge next generation ground control system platforms as well as computer vision and AI applications in the air and on the ground.\n\n\nWe're looking for a developer to work primarily in C\\+\\+ (with some tooling scripting) engineering systems in collaborative self\\-organizing Scrum teams, practicing test driven development, with the freedom to create the solution that actually fits the problem at hand.  \n\n  \n\nThe successful candidate will be responsible for developing reliable, mission critical, cross platform software, this includes:\n\n* Develop the solution (primarily in C\\+\\+) using test driven development. Responsible for writing tests from unit level to system end\\-to\\-end\n* Engineer solutions that provide optimal user experience\n* Participate in agile practices like estimation meetings, retrospectives, standups, etc.\n* Develop, maintain and document the architecture of the solution\n* Contribution to documentation, delivery, and deployment of the solution\n* Assist our customer experience team support the solution\n\n\nDuties may also include:\n\n* Opportunities to travel for on\\-site integration, training, flight trials\n* Opportunities to participate in local (Calgary area) LM CDL flight testing operations\n* Assisting LM CDL’s tooling team maintain industry best software development tools and techniques\n* Voluntary participation on LM CDL’s social committee\n\n**What you bring to the role**\n\n\n**Educational Credentials**\n\n\nThis is a 16\\-month internship position available engineering students who have completed their third year. This position will be of interest to students who are in:\n\n* Software Engineering;\n* Computer Engineering;\n* Geomatics Engineering;\n* Electrical Engineering (with a Computer Minor program); or,\n* Computer Science.\n\n**Experience, Skills and Talents**\n\n* Object\\-Oriented software design\n* Experience with the C\\+\\+ programming language\n* Software development experience on Linux and Microsoft Windows\n* Strong verbal and written communication skills\n* Some familiarity with agile software development process and test driven software development\n* Enjoys working in a collaborative team environment\n* Continually learn and improve based on focused feedback.\n\n**Additional skills desired for the role**\n\n\nWhile not required to apply for this position, the following skills and experience align with Lockheed Martin Skunk Works' core business competencies and our future growth areas.\n\n* Experience in the Uncrewed Vehicle (UV) domain\n* Experience and a desire to help our organization increase diversity, equity, and inclusion.\n* Android development experience\n* Experience with the ArduPilot auto pilot and/or the Mavlink vehicle communications protocol\n* Experience with the STANAG\\-4586 vehicle communications protocol\n* Experience with development and testing of of Artificial Intelligence software\n* Experience with Computer Vision software solutions\n\n**What we offer you**\n\n\nWe walk our talk when it comes to work/life balance! Your physical, mental and financial wellbeing matters to us. On top of working in a highly supportive, friendly, respectful environment, this is what you can expect when you join our team:\nCompetitive compensation\n\n\nTime to recharge with vacation, personal days, holidays, and parental leaves\n\n\nOnsite fitness facilities at our main office locations\n\n\nEmployee discounts to save on goods, services and various recreational activities\n\n\nAccess to a robust spectrum of development resources to enhance your skills and/or advance your career including:\n* Free learning resources through a modern and engaging platform\n* Education Assistance Program\n* Reimbursement for a professional membership\n* Self\\-directed Mentoring\n\n**About us**\n\n\nLockheed Martin Canada is the Canadian\\-based arm of Lockheed Martin Corporation, a global security and aerospace company employing 115,000 people worldwide, including more than 1,300 Canadians. By applying innovative approaches of our highly skilled and experienced Canadian workforce, we have been Canada’s trusted defence and aerospace partner for over 80 years. We operate major facilities in Ottawa, Montreal, Halifax, Calgary and Victoria and work on a wide range of programs from advanced naval technology products and unmanned systems software to providing delivery and in\\-service support of the latest military aircraft to commercial engine repair and overhaul capabilities. This position is part of the Lockheed Martin’s Aeronautics \\- Advanced Development Programs team also known as “Skunk Works”, specializing in the development and licensing of vehicle control station software for unmanned systems.\n**Equal Opportunity Statement**\n\n\nLockheed Martin Canada is an equal opportunity employer that values diversity in the workplace. We are committed to excellence in serving all customers, including people with disabilities, and we encourage feedback on the provision of these services.\n**Employee Type**\n\n\nFull Time\n**Vacancy Type**\n\n\nIntern/Co\\-Op\n**Security requirement for this role**\n\n\nControlled Goods Program",
        "company_industry": "nan",
        "company_url": "https://ca.indeed.com/cmp/Lockheed-Martin",
        "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/505888686d75860c8a1eade99b3361ca",
        "company_url_direct": "https://www.lockheedmartin.com",
        "company_addresses": "Bethesda, MD",
        "company_num_employees": "10,000+",
        "company_revenue": "more than $10B (USD)",
        "company_description": "With a rich history supporting collective success across Canadian industry, Lockheed Martin Canada continues to grow this positive impact as Canada’s trusted defence partner. Your Mission is Ours"
    },
    {
        "id": "in-579e3fcf7f4addd8",
        "site": "indeed",
        "job_url": "https://ca.indeed.com/viewjob?jk=579e3fcf7f4addd8",
        "job_url_direct": "http://ca.indeed.com/job/marketing-coordinator-intern-579e3fcf7f4addd8",
        "title": "Marketing Coordinator (Intern)",
        "company": "Trust Science Inc.",
        "location": "Edmonton, AB, CA",
        "date_posted": "2024-10-04",
        "job_type": "fulltime",
        "salary_source": "None",
        "interval": "None",
        "min_amount": "None",
        "max_amount": "None",
        "currency": "None",
        "is_remote": "True",
        "job_level": "None",
        "job_function": "None",
        "listing_type": "None",
        "emails": "nan",
        "description": "**Exciting Opportunity: Marketing Coordinator Intern**\n\n**Position:** Marketing Coordinator Intern\n\n**Reports to:** Marketing Manager\n\nJoin our vibrant, fast\\-growing company as a Marketing Coordinator Intern and immerse yourself in the dynamic worlds of Marketing and Sales. This role is perfect for a proactive individual eager to contribute to outward\\-facing communications and help drive our company's growth.\n\n**Responsibilities:**\n\n* **Marketing Collateral:** Collaborate with the Marketing Manager to create and refine digital, written, video, and graphic content for various needs including website, social media, and promotional materials.\n* **Website Management:** Assist in maintaining, optimizing, and updating our website to ensure content accuracy, SEO effectiveness, and user engagement.\n* **Social Media:** Implement strategies to enhance our social media presence, engage followers, and convert them into leads and customers.\n* **Marketing \\& Sales Support:** Support inbound marketing efforts through content creation that attracts Marketing Qualified Leads (MQLs). Assist in optimizing conversion paths on our website and through lead generation content.\n* **Competitor Analysis:** Gather and analyze competitor intelligence to inform marketing strategies and differentiate our offerings in the market.\n* **Innovative Marketing:** Contribute ideas and assist in executing new marketing initiatives under the guidance of the Marketing Manager.\n* **Additional Responsibilities:** Adapt to other tasks as assigned by supervisors to support company objectives.\n\n**Job Requirements:**\n\n* Excellent communication skills across verbal, written, and editing platforms, with the ability to adapt tone and style to various types of content.\n* Dedication to detail paired with creativity and innovative thinking.\n* Currently pursuing a BA/BSc/BCom degree, ideally in Marketing, Communications, Finance, or a related field.\n* Knowledge of analytics tools and graphic design is a plus.\n\n**About www.TrustScience.com**  \n**Trust Science ®** is a FinTech SaaS committed to using cutting\\-edge AI and ML technology to advance alternative credit underwriting with Credit Bureau 2\\.0 ® / Credit Bureau \\+™, helping lenders more fairly and accurately assess thin\\-file, financially stressed, or underbanked applicants. Trust Science’s patented technology gives lending leaders an ethical, powerful and compliant way to score borrowers missed by conventional credit models. Trust Science paves the way to a more financially inclusive economy in which deserving people get access to loans that they deserve.  \nWe pride ourselves in a corporate culture that continuously moves us towards a more engaged, equitable, diverse and inclusive community of high\\-quality people.\n\n**Our Vision**:  \nTo become a global platform that helps businesses and individuals assess strangers\n\n**Our Mission**:  \nTo Allow Deserving People to Get What They Deserve\n\n**Join us at Trust Science \\& be part of the future of financial inclusion.**  \nWe are always looking for talented, innovative minds who are driven to challenge the status quo and help reshape the world of credit. Together, we can transform the lending industry and empower individuals who have been underserved for far too long.\n\n**Why Choose Us?**  \nThis internship offers hands\\-on experience in a supportive environment where your ideas and contributions will directly impact our entire organization. Gain invaluable skills, work alongside passionate professionals, and be part of our journey towards excellence and financial inclusion.\n\n**Apply Now!**  \nIf you're ready to dive into a role that challenges you to grow while making a meaningful impact, we want to hear from you!\n\nJob Types: Full\\-time, Internship / Co\\-op\n\nPay: $15\\.00\\-$25\\.00 per hour\n\nBenefits:\n\n* Flexible schedule\n\nSchedule:\n\n* Monday to Friday\n\nWork Location: Hybrid remote in Edmonton, AB T5J 3N9\n\nExpected start date: 2025\\-01\\-06",
        "company_industry": "Internet And Software",
        "company_url": "https://ca.indeed.com/cmp/Trust-Science-Inc.-1",
        "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b19d9f293bd6c056564642a7fca462fd",
        "company_url_direct": "http://www.TrustScience.com",
        "company_addresses": "nan",
        "company_num_employees": "11 to 50",
        "company_revenue": "nan",
        "company_description": "At Trust Science, we pride ourselves in a corporate culture that continuously moves us towards a more engaged, equitable, diverse and inclusive community of high-quality employees."
    },
    {
        "id": "in-cbe5ca93df9365a9",
        "site": "indeed",
        "job_url": "https://ca.indeed.com/viewjob?jk=cbe5ca93df9365a9",
        "job_url_direct": "http://ca.indeed.com/job/security-analyst-internship-january-april-2025-cbe5ca93df9365a9",
        "title": "Security Analyst Internship: January to April 2025",
        "company": "Trust Science Inc.",
        "location": "Edmonton, AB, CA",
        "date_posted": "2024-10-03",
        "job_type": "nan",
        "salary_source": "None",
        "interval": "None",
        "min_amount": "None",
        "max_amount": "None",
        "currency": "None",
        "is_remote": "True",
        "job_level": "None",
        "job_function": "None",
        "listing_type": "None",
        "emails": "nan",
        "description": "***Job Summary***\n\nThe **Security Analyst Intern** will participate in ensuring that Trust Science meets its Information Security and Privacy obligations whether legal, contractual, or self\\-imposed in content and cadence.\n\nTrust Science is grateful for the support of government programs that help us offer internship opportunities. As such, this role is open only to Canadian students currently enrolled in a post\\-secondary institution in Canada, with plans to return to school for at least one more semester after the internship. Please note, recent graduates are not eligible for this government\\-funded internship.\n\n**Key Accountabilities**\n\nDuties and responsibilities may include, but are not be limited to the following:\n\n* Ensuring the security and privacy compliance of all aspects of the Trust Science SaaS platform.\n* Participating in specific security, data privacy, and compliance improvement projects – may include technical and / or policy\\-related work, depending on applicant’s qualifications.\n* Supporting, monitoring, and reporting on the effective monitoring, reporting, and remediation of all information security, data privacy and compliance requirements.\n* Ensuring adherence of Trust Science to its internal security and privacy policies.\n* Ensuring information security and privacy compliance gaps are identified and managed, noting and escalating any outstanding gaps to the Chief Security and Privacy Officer (CSPO).\n* Consulting on information security and privacy compliance issues, assisting in identifying and delivering on areas of improvement within information security and data privacy compliance.\n* Support the management of day\\-to\\-day operational matters of information security, compliance, and data privacy.\n* Help identify and document requirements, assess physical and technical security risks to data, software and hardware.\n* Help develop policies, procedures and contingency plans to prevent and minimize the effects of security breaches.\n* Research security solutions, implement, and document their implementation / use.\n* Monitor systems / services and create trouble tickets (Jira) for messages requiring action.\n* Other duties as assigned from time\\-to\\-time by their supervisor.\n\n**Qualifications**:\n\n* Pursuing a Bachelor’s or Master’s degree in science, information, programming, or related field.\n* Experience or desire to work in security or privacy operations.\n* The ability to to work in a high\\-stress environment with rapidly evolving priorities.\n* Excellent verbal and written communication skills.\n* Curious: ask probing questions, dig deep and maintain an open\\-mind.\n\n**About** **www.TrustScience.com**\n\n**Trust Science ®** is a FinTech SaaS committed to using cutting\\-edge AI and ML technology to advance alternative credit underwriting with Credit Bureau 2\\.0 ® / Credit Bureau \\+™, helping lenders more fairly and accurately assess thin\\-file, financially stressed, or underbanked applicants. Trust Science’s patented technology gives lending leaders an ethical, powerful and compliant way to score borrowers missed by conventional credit models. Trust Science paves the way to a more financially inclusive economy in which deserving people get access to loans that they deserve.\n\nWe pride ourselves in a corporate culture that continuously moves us towards a more engaged, equitable, diverse and inclusive community of high\\-quality people.\n\n**Our Vision**:\n\nTo become a global platform that helps businesses and individuals assess strangers\n\n**Our Mission**:\n\nTo Allow Deserving People to Get What They Deserve\n\n**Join us at Trust Science \\& be part of the future of financial inclusion.** \n\nWe are always looking for talented, innovative minds who are driven to challenge the status quo and help reshape the world of credit. Together, we can transform the lending industry and empower individuals who have been underserved for far too long.\n\n**Why Choose Us?**\n\nThis internship offers hands\\-on experience in a supportive environment where your ideas and contributions will directly impact our entire organization. Gain invaluable skills, work alongside passionate professionals, and be part of our journey towards excellence and financial inclusion.\n\n**Apply Now!** \n\nIf you're ready to dive into a role that challenges you to grow while making a meaningful impact, we want to hear from you!\n\nJob Type: Internship / Co\\-op  \nContract length: 4 months\n\nPay: $18\\.00\\-$25\\.00 per hour\n\nExpected hours: No more than 40 per week\n\nBenefits:\n\n* Flexible schedule\n* Work from home\n\nFlexible language requirement:\n\n* French not required\n\nSchedule:\n\n* Monday to Friday\n\nApplication question(s):\n\n* Are you a Canadian student currently enrolled in a post\\-secondary institution in Canada, with plans to return to school for at least one more semester after the internship?\n\nWe’re grateful for the support of government programs that help us offer internship opportunities. As such, this role is open only to Canadian students currently enrolled in a post\\-secondary institution in Canada, with plans to return to school for at least one more semester after the internship. Please note, recent graduates not eligible for this government\\-funded internship.\n\nWork Location: Hybrid remote in Edmonton, AB T5J 3N9\n\nExpected start date: 2025\\-01\\-06",
        "company_industry": "Internet And Software",
        "company_url": "https://ca.indeed.com/cmp/Trust-Science-Inc.-1",
        "company_logo": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/b19d9f293bd6c056564642a7fca462fd",
        "company_url_direct": "http://www.TrustScience.com",
        "company_addresses": "nan",
        "company_num_employees": "11 to 50",
        "company_revenue": "nan",
        "company_description": "At Trust Science, we pride ourselves in a corporate culture that continuously moves us towards a more engaged, equitable, diverse and inclusive community of high-quality employees."
    }
]